Тест_ЗУП_31_КОРП/src/DataProcessors/ПроведениеДокументовПоВидамУчета/ПроведениеДокументовПоВидамУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроведениеДокументовПоВидамУчета</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетСреднегоЗаработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Тест_ЗУП_31_КОРП/src/AccumulationRegisters/НачисленияУдержанияПоСотрудникам/НачисленияУдержанияПоСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачисленияУдержанияПоСотрудникам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОплаченоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОплаченоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГруппаНачисленияУдержанияВыплаты</name>
    <type>
      <types>EnumRef.ГруппыНачисленияУдержанияВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеНачисленияУдержания</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеМежрасчетногоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияВыполненияРаботВОрганизации</name>
    <type>
      <types>DefinedType.ТерриторияВыполненияРаботВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <comment>для строк НДФЛ</comment>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеВзыскания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачислениеУдержание</name>
    <type>
      <types>EnumRef.ВидыВзаиморасчетовССотрудниками</types>
      <types>EnumRef.ВидыОсобыхНачисленийИУдержаний</types>
      <types>ChartOfCalculationTypesRef.Начисления</types>
      <types>ChartOfCalculationTypesRef.Удержания</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест_ЗУП_31_КОРП/src/AccumulationRegisters/ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий/ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядокРасчета</name>
    <type>
      <types>EnumRef.ПорядокРасчетаСреднегоЗаработкаОбщий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставнаяЧасть</name>
    <type>
      <types>EnumRef.УчетНачисленийВСреднемЗаработкеОбщий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособОтраженияЗарплатыВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОблагаетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Индексируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаБазовогоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест_ЗУП_31_КОРП/src/Enums/УчетНачисленийВСреднемЗаработкеОбщий/УчетНачисленийВСреднемЗаработкеОбщий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетНачисленийВСреднемЗаработкеОбщий</name>
  <enumValues>
    <name>ОбщийЗаработок</name>
  </enumValues>
  <enumValues>
    <name>ПремияФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ПремияПроцентом</name>
  </enumValues>
  <enumValues>
    <name>ПремияГодоваяФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ПремияГодоваяПроцентом</name>
  </enumValues>
  <enumValues>
    <name>НеВключать</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/УчетНачисленийВСреднемЗаработкеФСС/УчетНачисленийВСреднемЗаработкеФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетНачисленийВСреднемЗаработкеФСС</name>
  <enumValues>
    <name>Включать</name>
  </enumValues>
  <enumValues>
    <name>НеВключать</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/DataProcessors/ПроведениеДокументовПоВидамУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура ПровестиДокументыПоУчетам(Параметры, АдресХранилища) Экспорт
	
	ВидыУчета = Параметры.ВидыУчета;
		
	МассивДокументов = МассивДокументов(Параметры, ВидыУчета);
	
	Для Каждого Документ Из МассивДокументов Цикл
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПереносДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		УстановитьПривилегированныйРежим(Истина);
		Отказ = Ложь;
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ);
		МенеджерДокумента.ПровестиПоУчетам(Документ, РежимПроведенияДокумента.Неоперативный, Отказ, ВидыУчета);		
		УстановитьПривилегированныйРежим(Ложь);
		ЗафиксироватьТранзакцию();
	 	 		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Истина, АдресХранилища);
	                                               	
КонецПроцедуры

Функция МассивДокументов(Параметры, ВидыУчета)
	
	Если ВидыУчета = "ДанныеДляРасчетаСреднего" Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НачисленияСреднийЗаработокОбщий.Ссылка КАК Начисление
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	ПланВидовРасчета.Начисления.СреднийЗаработокОбщий КАК НачисленияСреднийЗаработокОбщий
		|ГДЕ
		|	НачисленияСреднийЗаработокОбщий.Значение <> &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияСреднийЗаработокФСС.Ссылка
		|ИЗ
		|	ПланВидовРасчета.Начисления.СреднийЗаработокФСС КАК НачисленияСреднийЗаработокФСС
		|ГДЕ
		|	НачисленияСреднийЗаработокФСС.Значение <> &ЗначениеФСС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_Начисления.Начисление
		|ПОМЕСТИТЬ ВТ_НачисленияБезДублей
		|ИЗ
		|	ВТ_Начисления КАК ВТ_Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НачисленияУдержанияПоСотрудникамОбороты.Регистратор
		|ПОМЕСТИТЬ ВТ_Регистраторы
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Организация = &Организация
		|				И НачислениеУдержание В
		|					(ВЫБРАТЬ
		|						ВТ_НачисленияБезДублей.Начисление
		|					ИЗ
		|						ВТ_НачисленияБезДублей КАК ВТ_НачисленияБезДублей)) КАК НачисленияУдержанияПоСотрудникамОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Регистратор
		|ИЗ
		|	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий КАК ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий
		|ГДЕ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Организация = &Организация
		|	И ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор
		|ИЗ
		|	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС КАК ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС
		|ГДЕ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор.Организация = &Организация
		|	И ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_Регистраторы.Регистратор
		|ИЗ
		|	ВТ_Регистраторы КАК ВТ_Регистраторы";
		
		Если Не ЗначениеЗаполнено(Параметры.Организация) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор.Организация = &Организация", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Организация = &Организация", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "ИСТИНА");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("ДатаНачала", Параметры.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Параметры.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("Значение", Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.НеВключать);
		Запрос.УстановитьПараметр("ЗначениеФСС", Перечисления.УчетНачисленийВСреднемЗаработкеФСС.НеВключать);
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
